/*#########################################################
  ##Библиотека для работы с аппаратным I2C(TWI).(c)DSuhoi##
  #########################################################*/

#ifndef __TWI_H_
#define __TWI_H_

#define F_CPU 8000000UL //частота микроконтроллера

void i2c_init(unsigned long);	 //инициализация портов
void i2c_start(void);		 //сигнал старта
void i2c_stop(void);		 //сигнал окончания
uint8_t i2c_write_byte(uint8_t); //передача байта
uint8_t i2c_read_byte(uint8_t);	 //прием байта (1-прием последнего байта)

#endif
